# Программа для определения принадлежности точкек заштрихованной области.
# Сушина АД ИУ7-11б

x1,y1 = map(float,input('Введите координаты точки 1 через пробел:').split())
print()

if abs(y1) <= 1.2 or abs(x1) <= 1.2:
    if y1 <= -3/4*x1+3 and y1 <= 3/4*x1+3:
        if y1 >= 3/4*x1-3 and y1 >= -3/4*x1-3:
            print('Точка 1 принадлежит фигуре.')
        else:
            print('Точка 1 не принадлежит фигуре.')
    else:
        print('Точка 1 не принадлежит фигуре.')
else:
    print('Точка 1 не принадлежит фигуре.')
print()

x2,y2 = map(float,input('Введите координаты точки 2 через пробел:').split())
print()

if abs(y2) >= 1.2 or abs(x2) >= 1.2:
    if y2 <= -3/4*x2+3 and y2 <= 3/4*x2+3:
        if y2 >= 3/4*x1-3 and y2 >= -3/4*x1-3:
            print('Точка 2 принадлежит фигуре.')
        else:
            print('Точка 2 не принадлежит фигуре.')
    else:
        print('Точка 2 не принадлежит фигуре.')
else:
    print('Точка 2 не принадлежит фигуре.')
print()

x3,y3 = map(float,input('Введите координаты точки 3 через пробел:').split())
print()

if abs(y3) >= 1.2 or abs(x3) >= 1.2:
    if y3 <= -3/4*x3+3 and y3 <= 3/4*x3+3:
        if y3 >= 3/4*x3-3 and y3>= -3/4*x3-3:
            print('Точка 3 принадлежит фигуре.')
        else:
            print('Точка 3 не принадлежит фигуре.')
    else:
        print('Точка 3 не принадлежит фигуре.')
else:
    print('Точка 3 не принадлежит фигуре.')
print()


x4,y4 = map(float,input('Введите координаты точки 4 через пробел:').split())
print()

if abs(y4) >= 1.2 or abs(x4) >= 1.2:
    if y4 <= -3/4*x3+3 and y4 <= 3/4*x3+3:
        if y4 >= 3/4*x3-3 and y4>= -3/4*x3-3:
            print('Точка 4 принадлежит фигуре.')
        else:
            print('Точка 4 не принадлежит фигуре.')
    else:
        print('Точка 4 не принадлежит фигуре.')
else:
    print('Точка 4 не принадлежит фигуре.')
print()

x5,y5 = map(float,input('Введите координаты точки 5 через пробел:').split())
print()

if abs(y4) >= 1.2 or abs(x4) >= 1.2:
    if y4 <= -3/4*x3+3 and y4 <= 3/4*x3+3:
        if y4 >= 3/4*x3-3 and y4>= -3/4*x3-3:
            print('Точка 5 принадлежит фигуре.')
        else:
            print('Точка 5 не принадлежит фигуре.')
    else:
        print('Точка 5 не принадлежит фигуре.')
else:
    print('Точка 5 не принадлежит фигуре.')
print()
